#include <iostream>
#include<stdlib.h>
#include<time.h>
#include <cmath>
#include <Windows.h>

using namespace std;

int main()
{
	SetConsoleOutputCP(1251);
	SetConsoleCP(1251);
	int number_size = 0; // Для количества отрицательных элементов
	int* pNumber_size = &number_size;
	const int size = 100; // Размерность массива
	// m - указатель на первый элемент массива, ("на нулевой")
	int m[size] = { 16, 78, 99, 6, -29, 19, -52, 65, -88, 51,
					-79, -22, 32, -25, -62, -69, -2, -59, -75, 89,
					-87, 95, -22, 85, -49, -75, 76, 73, -59, -52,
					30, 49, -28, -48, 0, 57, -6, -85, 0, -18,
					-97, -21, -95, 64, 22, -2, 69, -84, -1, -71,
					-25, 47, 72, 43, 15, -44, 44, 61, 4, 74,
					88, -61, 0, -64, -83, 97, 0, 90, 15, 8,
					-54, 19, 73, 35, -67, -87, 85, -99, -70, 10,
					98, 58, -10, -29, 95, 62, 77, 89, 36, -32,
					78, 60, -79, -18, 30, -13, -34, -92, 1, -38 };

	for (int i = 0; i < size; i++)
	{
		if (*(m + i) < 0) // Косвенная адресация, использую указатель на первый элемент массива - m, увеличиваю его
		{
			*pNumber_size += 1;
		}
	}
	// Печатаю
	cout << "Кол-во отрицательных элементов: " << *pNumber_size << endl;

	system("pause");
	return 0;
}
