#include <iostream>
#include <cmath>
#include <Windows.h>

using namespace std;

int main()
{

	SetConsoleOutputCP(1251);
	SetConsoleCP(1251);
	unsigned long long int n = 0;
	long double x, eps;
	cout << "Введите x: ";
	cin >> x;
	cout << "Введите требуемую точность вычислений: ";
	cin >> eps;
	long double ch = 1, y = ch;
	for (; fabs(ch) > eps; n++)
	{
		cout << "итерация № " << n << ", Слагаемое: " << ch << "\t\t\t\tПромежуточнкая сумма: " << y << endl;
		ch = ch * pow(x, 2) / ((2 * n + 1) * (2 * n + 2));
		y = y + ch;
	}
	cout << endl << "x = " << x << ", Итоговая сумма = " << y << endl;
	cout << "К-во итераций n = " << n << endl;
















	/*SetConsoleOutputCP(1251);
	SetConsoleCP(1251);

	for (int i = 0; i < 50; i++)
	{
		cout << "Итерация № " << i << " началась:\t" << pow(i, 2) << '\t' << sqrt(i) << endl;
		if (i == 5)
		{
			cout << "Сработал continue \n";
			continue;
		}
		if (i == 10)
		{
			cout << "Сработал break \n";
			break;
		}
		cout << "Итерация № " << i << " завершена. \n";
	}
	cout << "-------------------------------------------\n\t\tЦикл завершен. \n";*/






	//cout << "Итерация № i\ti^2\tsqrt(i)\n-------------------------------------------\n"; // Шапка
	//// создадим цикл на 10 итераций: с нудевой итерации до девятой итерации включительно 
	//for (int i = 0; i < 50; i = i + 3)
	//{// в теле цикла печатается номер итерации, это же число возводится в квадрат и из него извлекаетя квадратный корень  
	//	cout << "Итерация № " << i << ":\t" << pow(i, 2) << '\t' << sqrt(i) << endl;
	//}
 //
	//cout << "-------------------------------------------\n\t\tЦикл завершен. \n";
	//
	//cout << "Итерация № i\ti^2\tsqrt(i)\n-------------------------------------------\n"; // Шапка
	//int i = 0;
	//while (i < 50)
	//{
	//	cout << "Итерация № " << i << ":\t" << pow(i, 2) << '\t' << sqrt(i) << endl;
	//	i+=3;
	//}
	//cout << "-------------------------------------------\n\t\tЦикл завершен. \n";

	//i = 0;
	//do
	//{
	//	cout << "Итерация № " << i << ":\t" << pow(i, 2) << '\t' << sqrt(i) << endl;
	//	i += 3;
	//} while (i < 50);
	//cout << "-------------------------------------------\n\t\tЦикл завершен. \n";


	system("pause");
	return 0;
}